import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class DataService {

  constructor() { }
  // ******************************************************************
  specialty() {
    return [
      {
        id: 1,
        name: "العظام والمفاصل"
      },
      {
        id: 2,
        name: "الاسنان"
      },
      {
        id: 3,
        name: "النساء والتوليد"
      },
      {
        id: 4,
        name: "الاطفال"
      },
      {
        id: 5,
        name: "الباطنه"
      },
     
      {
        id: 6,
        name: "التجميل"
      }
      ,
      {
        id: 7,
        name: "الانف والاذن والحنجره"
      }

    ]
  }

  //********************************************* */
  doctor() {
    return [
      {
        id: 1,
        name: " الدكتور احمد ابراهيم ",
        id2:1
      },
      {
        id: 1,
        name: "  الدكتور ابراهيم حسن",
        id2:2

      },
      {
        id: 1,
        name: " الدكتور مصطفي ايمن ",
        id2:3

      },
      {
        id: 2,
        name: " الدكتور محمد عبده",
        id2:4

      },
      {
        id:2,
        name: " الدكتور عمر محمد",
        id2:5

      },
      {
        id:2,
        name: " الدكتور محمد ايمن",
        id2:6

      },
      {
        id: 3,
        name: " الدكتوره سعاد محمود",
        id2:7

      },
      {
        id: 3,
        name: " الدكتوره مرفت نصرالدين",
        id2:8

      },
      {
        id: 3,
        name: " الدكتور ابراهيم محمد",
        id2:9

      },
      {
        id: 4,
        name: " الدكتور عمر بدوي ",
        id2:10

      },
      {
        id: 4,
        name: " الدكتور محمد صابر",
        id2:11

      },
      {
        id: 4,
        name: " الدكتور وائل مجدي",
        id2:12

      },
      {
        id: 5,
        name: " الدكتور محمد محمود",
        id2:13

      },
      {
        id: 5,
        name: " الدكتور توفيق ابراهيم",
        id2:14

      },
      {
        id: 5,
        name: " الدكتور صابر محمد",
        id2:15

      },
      {
        id: 6,
        name: " الدكتور تامر ايمن",
        id2:16

      },
      {
        id: 6,
        name: " الدكتور عبدالله اشرف",
        id2:17

      },
      {
        id: 6,
        name: " الدكتور طه صابر",
        id2:18

      },
      {
        id: 7,
        name: " الدكتور ممدوح محمد",
        id2:19

      },
      {
        id: 7,
        name: " الدكتور حسن هلال",
        id2:20

      },
      {
        id: 7,
        name: " الدكتور محمد احمد",
        id2:21

      }
     
    ]
  }
  // *************************************************
  time(){
    return[
      {
        id2:1,
        name:"الجمعه الساعه 1م "
      },
      {
        id2:1,
        name:"السبت الساعه 2م "
      },
      {
        id2:1,
        name:"الاحد الساعه 2:30م "
      },
      {
        id2:2,
        name:"الاثنين الساعه 1م "
      },
      {
        id2:2,
        name:"الثلاثاء الساعه 2م "
      },
      {
        id2:3,
        name:"الاربع الساعه 2:  "
      },
      {
        id2:3,
        name:"الخميس الساعه  2م"
      },
      {
        id2:4,
        name:"الجمعه الساعه  9ص"
      },
      {
        id2:4,
        name:"السبت الساعه  10ص "
      },
      {
        id2:4,
        name:"الاحد الساعه  3م"
      },
      {
        id2:5,
        name:"الاثنين الساعه 1م   "
      },
      {
        id2:5,
        name:"الثلاثاء الساعه 3م   "
      },
      {
        id2:6,
        name:"الاربع الساعه 11م   "
      },
      {
        id2:6,
        name:"الخميس الساعه 11م   "
      },
      {
        id2:7,
        name:"الجمعه الساعه 1ص   "
      },
      {
        id2:7,
        name:"السبت الساعه 4ص   "
      },
      {
        id2:7,
        name:"الاحد الساعه 7م   "
      },
      {
        id2:8,
        name:"الاثنين الساعه 10ص   "
      },
      {
        id2:8,
        name:"الثلاثاء الساعه 11ص   "
      },
      {
        id2:9,
        name:"الاربع الساعه 4م   "
      },
      {
        id2:9,
        name:"الخميس الساعه 9م   "
      },
      {
        id2:10,
        name:"الجمعه الساعه 2ص   "
      },
      {
        id2:10,
        name:"السبت الساعه 3م   "
      },
      {
        id2:10,
        name:"الاحد الساعه 11م   "
      },
      {
        id2:11,
        name:"الاثنين الساعه 8م   "
      },
      {
        id2:11,
        name:"الثلاثاء الساعه 5ص   "
      },
      {
        id2:12,
        name:"الاربع الساعه 12ص   "
      },
      {
        id2:12,
        name:"الخميس الساعه 10ص   "
      },
      {
        id2:13,
        name:"الجمعه الساعه 9م   "
      },
      {
        id2:13,
        name:"السبت الساعه 10ص   "
      },
      {
        id2:13,
        name:"الاحد الساعه 5ص   "
      },
      {
        id2:14,
        name:"الاثنين الساعه 1م   "
      },
      {
        id2:14,
        name:"الثلاثاء الساعه 4ص   "
      },
      {
        id2:15,
        name:"الاربع الساعه 4ص   "
      },
      {
        id2:15,
        name:"الخميس الساعه 2م   "
      },
      {
        id2:16,
        name:"الجمعه الساعه 1م   "
      },
      {
        id2:16,
        name:"السبت الساعه 10ص   "
      },
      {
        id2:16,
        name:"الاحد الساعه 9ص   "
      },
      {
        id2:17,
        name:"الاثنين الساعه 10م   "
      },
      {
        id2:17,
        name:"الثلاثاء الساعه 3م   "
      },
      {
        id2:18,
        name:"الاربع الساعه 11م"
      },
      {
        id2:18,
        name:"الخميس الساعه 9م"
      },
      {
        id2:19,
        name:"الجمعه الساعه 1م"
      },
      {
        id2:19,
        name:"السبت الساعه 3م"
      },
      {
        id2:19,
        name:"الاحد الساعه 4م"
      },
      {
        id2:20,
        name:"الاثنين الساعه 12ص"
      },
      {
        id2:20,
        name:"الثلاثاء الساعه 9م"
      },
      {
        id2:21,
        name:"الاربع الساعه 12م"
      },
      {
        id2:21,
        name:"الخميس الساعه 6م"
      },
    ]
  }

}
